# # Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

# # Пример:

# # - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# # n = int(input("Ведите число:"))
# # f=1
# # res = {}
# # for i in range(1, n+1):
# #         f=f*i
# #         res[i]=f
# # print(res)


# # ****************************************************************************************************************************************
# # Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.

# # Пример:

# # - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

# n = int(input("Ведите число:"))
# f = 1
# res = 0
# for i in range(1, n+1):
#     f = (1+1/i)**i 
#     res +=f
# res = float('{:.2f}'.format(res))
# print(res)


# # /////////////////////////////////////////////////////////////////////////////////////////////////////////
# # Реализуйте алгоритм перемешивания списка.
# my_list=[1,2,3,4,5,6,7,8,9]
# import random
# def shuffle(arr1):
#     random.shuffle(arr1)
#     return arr1

# print(my_list)
# print(shuffle(my_list))